7767517
920 1117
Input            input                    0 1 input
Split            splitncnn_input0         1 3 input input_splitncnn_0 input_splitncnn_1 input_splitncnn_2
MemoryData       /gblocks/gblocks.1/norm/Constant_2_output_0 0 1 /gblocks/gblocks.1/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.1/norm/Constant_3_output_0 0 1 /gblocks/gblocks.1/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.1/norm/Constant_4_output_0 0 1 /gblocks/gblocks.1/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.1/norm/Constant_5_output_0 0 1 /gblocks/gblocks.1/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.10/norm/Constant_2_output_0 0 1 /gblocks/gblocks.10/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.10/norm/Constant_3_output_0 0 1 /gblocks/gblocks.10/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.10/norm/Constant_4_output_0 0 1 /gblocks/gblocks.10/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.10/norm/Constant_5_output_0 0 1 /gblocks/gblocks.10/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.11/norm/Constant_2_output_0 0 1 /gblocks/gblocks.11/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.11/norm/Constant_3_output_0 0 1 /gblocks/gblocks.11/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.11/norm/Constant_4_output_0 0 1 /gblocks/gblocks.11/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.11/norm/Constant_5_output_0 0 1 /gblocks/gblocks.11/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.12/norm/Constant_2_output_0 0 1 /gblocks/gblocks.12/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.12/norm/Constant_3_output_0 0 1 /gblocks/gblocks.12/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.12/norm/Constant_4_output_0 0 1 /gblocks/gblocks.12/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.12/norm/Constant_5_output_0 0 1 /gblocks/gblocks.12/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.13/norm/Constant_2_output_0 0 1 /gblocks/gblocks.13/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.13/norm/Constant_3_output_0 0 1 /gblocks/gblocks.13/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.13/norm/Constant_4_output_0 0 1 /gblocks/gblocks.13/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.13/norm/Constant_5_output_0 0 1 /gblocks/gblocks.13/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.14/norm/Constant_2_output_0 0 1 /gblocks/gblocks.14/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.14/norm/Constant_3_output_0 0 1 /gblocks/gblocks.14/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.14/norm/Constant_4_output_0 0 1 /gblocks/gblocks.14/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.14/norm/Constant_5_output_0 0 1 /gblocks/gblocks.14/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.15/norm/Constant_2_output_0 0 1 /gblocks/gblocks.15/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.15/norm/Constant_3_output_0 0 1 /gblocks/gblocks.15/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.15/norm/Constant_4_output_0 0 1 /gblocks/gblocks.15/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.15/norm/Constant_5_output_0 0 1 /gblocks/gblocks.15/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.16/norm/Constant_2_output_0 0 1 /gblocks/gblocks.16/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.16/norm/Constant_3_output_0 0 1 /gblocks/gblocks.16/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.16/norm/Constant_4_output_0 0 1 /gblocks/gblocks.16/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.16/norm/Constant_5_output_0 0 1 /gblocks/gblocks.16/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.17/norm/Constant_2_output_0 0 1 /gblocks/gblocks.17/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.17/norm/Constant_3_output_0 0 1 /gblocks/gblocks.17/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.17/norm/Constant_4_output_0 0 1 /gblocks/gblocks.17/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.17/norm/Constant_5_output_0 0 1 /gblocks/gblocks.17/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.18/norm/Constant_2_output_0 0 1 /gblocks/gblocks.18/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.18/norm/Constant_3_output_0 0 1 /gblocks/gblocks.18/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.18/norm/Constant_4_output_0 0 1 /gblocks/gblocks.18/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.18/norm/Constant_5_output_0 0 1 /gblocks/gblocks.18/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.19/norm/Constant_2_output_0 0 1 /gblocks/gblocks.19/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.19/norm/Constant_3_output_0 0 1 /gblocks/gblocks.19/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.19/norm/Constant_4_output_0 0 1 /gblocks/gblocks.19/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.19/norm/Constant_5_output_0 0 1 /gblocks/gblocks.19/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.2/norm/Constant_2_output_0 0 1 /gblocks/gblocks.2/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.2/norm/Constant_3_output_0 0 1 /gblocks/gblocks.2/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.2/norm/Constant_4_output_0 0 1 /gblocks/gblocks.2/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.2/norm/Constant_5_output_0 0 1 /gblocks/gblocks.2/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.20/norm/Constant_2_output_0 0 1 /gblocks/gblocks.20/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.20/norm/Constant_3_output_0 0 1 /gblocks/gblocks.20/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.20/norm/Constant_4_output_0 0 1 /gblocks/gblocks.20/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.20/norm/Constant_5_output_0 0 1 /gblocks/gblocks.20/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.21/norm/Constant_2_output_0 0 1 /gblocks/gblocks.21/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.21/norm/Constant_3_output_0 0 1 /gblocks/gblocks.21/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.21/norm/Constant_4_output_0 0 1 /gblocks/gblocks.21/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.21/norm/Constant_5_output_0 0 1 /gblocks/gblocks.21/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.22/norm/Constant_2_output_0 0 1 /gblocks/gblocks.22/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.22/norm/Constant_3_output_0 0 1 /gblocks/gblocks.22/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.22/norm/Constant_4_output_0 0 1 /gblocks/gblocks.22/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.22/norm/Constant_5_output_0 0 1 /gblocks/gblocks.22/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.23/norm/Constant_2_output_0 0 1 /gblocks/gblocks.23/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.23/norm/Constant_3_output_0 0 1 /gblocks/gblocks.23/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.23/norm/Constant_4_output_0 0 1 /gblocks/gblocks.23/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.23/norm/Constant_5_output_0 0 1 /gblocks/gblocks.23/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.24/norm/Constant_2_output_0 0 1 /gblocks/gblocks.24/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.24/norm/Constant_3_output_0 0 1 /gblocks/gblocks.24/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.24/norm/Constant_4_output_0 0 1 /gblocks/gblocks.24/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.24/norm/Constant_5_output_0 0 1 /gblocks/gblocks.24/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.3/norm/Constant_2_output_0 0 1 /gblocks/gblocks.3/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.3/norm/Constant_3_output_0 0 1 /gblocks/gblocks.3/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.3/norm/Constant_4_output_0 0 1 /gblocks/gblocks.3/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.3/norm/Constant_5_output_0 0 1 /gblocks/gblocks.3/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.4/norm/Constant_2_output_0 0 1 /gblocks/gblocks.4/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.4/norm/Constant_3_output_0 0 1 /gblocks/gblocks.4/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.4/norm/Constant_4_output_0 0 1 /gblocks/gblocks.4/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.4/norm/Constant_5_output_0 0 1 /gblocks/gblocks.4/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.5/norm/Constant_2_output_0 0 1 /gblocks/gblocks.5/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.5/norm/Constant_3_output_0 0 1 /gblocks/gblocks.5/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.5/norm/Constant_4_output_0 0 1 /gblocks/gblocks.5/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.5/norm/Constant_5_output_0 0 1 /gblocks/gblocks.5/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.6/norm/Constant_2_output_0 0 1 /gblocks/gblocks.6/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.6/norm/Constant_3_output_0 0 1 /gblocks/gblocks.6/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.6/norm/Constant_4_output_0 0 1 /gblocks/gblocks.6/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.6/norm/Constant_5_output_0 0 1 /gblocks/gblocks.6/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.7/norm/Constant_2_output_0 0 1 /gblocks/gblocks.7/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.7/norm/Constant_3_output_0 0 1 /gblocks/gblocks.7/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.7/norm/Constant_4_output_0 0 1 /gblocks/gblocks.7/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.7/norm/Constant_5_output_0 0 1 /gblocks/gblocks.7/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.8/norm/Constant_2_output_0 0 1 /gblocks/gblocks.8/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.8/norm/Constant_3_output_0 0 1 /gblocks/gblocks.8/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.8/norm/Constant_4_output_0 0 1 /gblocks/gblocks.8/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.8/norm/Constant_5_output_0 0 1 /gblocks/gblocks.8/norm/Constant_5_output_0 0=1
MemoryData       /gblocks/gblocks.9/norm/Constant_2_output_0 0 1 /gblocks/gblocks.9/norm/Constant_2_output_0 0=1
MemoryData       /gblocks/gblocks.9/norm/Constant_3_output_0 0 1 /gblocks/gblocks.9/norm/Constant_3_output_0 0=1
MemoryData       /gblocks/gblocks.9/norm/Constant_4_output_0 0 1 /gblocks/gblocks.9/norm/Constant_4_output_0 0=1
MemoryData       /gblocks/gblocks.9/norm/Constant_5_output_0 0 1 /gblocks/gblocks.9/norm/Constant_5_output_0 0=1
MemoryData       gblocks.1.norm.bias      0 1 gblocks.1.norm.bias 0=64
MemoryData       gblocks.1.norm.weight    0 1 gblocks.1.norm.weight 0=64
MemoryData       gblocks.10.norm.bias     0 1 gblocks.10.norm.bias 0=64
MemoryData       gblocks.10.norm.weight   0 1 gblocks.10.norm.weight 0=64
MemoryData       gblocks.11.norm.bias     0 1 gblocks.11.norm.bias 0=64
MemoryData       gblocks.11.norm.weight   0 1 gblocks.11.norm.weight 0=64
MemoryData       gblocks.12.norm.bias     0 1 gblocks.12.norm.bias 0=64
MemoryData       gblocks.12.norm.weight   0 1 gblocks.12.norm.weight 0=64
MemoryData       gblocks.13.norm.bias     0 1 gblocks.13.norm.bias 0=64
MemoryData       gblocks.13.norm.weight   0 1 gblocks.13.norm.weight 0=64
MemoryData       gblocks.14.norm.bias     0 1 gblocks.14.norm.bias 0=64
MemoryData       gblocks.14.norm.weight   0 1 gblocks.14.norm.weight 0=64
MemoryData       gblocks.15.norm.bias     0 1 gblocks.15.norm.bias 0=64
MemoryData       gblocks.15.norm.weight   0 1 gblocks.15.norm.weight 0=64
MemoryData       gblocks.16.norm.bias     0 1 gblocks.16.norm.bias 0=64
MemoryData       gblocks.16.norm.weight   0 1 gblocks.16.norm.weight 0=64
MemoryData       gblocks.17.norm.bias     0 1 gblocks.17.norm.bias 0=64
MemoryData       gblocks.17.norm.weight   0 1 gblocks.17.norm.weight 0=64
MemoryData       gblocks.18.norm.bias     0 1 gblocks.18.norm.bias 0=64
MemoryData       gblocks.18.norm.weight   0 1 gblocks.18.norm.weight 0=64
MemoryData       gblocks.19.norm.bias     0 1 gblocks.19.norm.bias 0=64
MemoryData       gblocks.19.norm.weight   0 1 gblocks.19.norm.weight 0=64
MemoryData       gblocks.2.norm.bias      0 1 gblocks.2.norm.bias 0=64
MemoryData       gblocks.2.norm.weight    0 1 gblocks.2.norm.weight 0=64
MemoryData       gblocks.20.norm.bias     0 1 gblocks.20.norm.bias 0=64
MemoryData       gblocks.20.norm.weight   0 1 gblocks.20.norm.weight 0=64
MemoryData       gblocks.21.norm.bias     0 1 gblocks.21.norm.bias 0=64
MemoryData       gblocks.21.norm.weight   0 1 gblocks.21.norm.weight 0=64
MemoryData       gblocks.22.norm.bias     0 1 gblocks.22.norm.bias 0=64
MemoryData       gblocks.22.norm.weight   0 1 gblocks.22.norm.weight 0=64
MemoryData       gblocks.23.norm.bias     0 1 gblocks.23.norm.bias 0=64
MemoryData       gblocks.23.norm.weight   0 1 gblocks.23.norm.weight 0=64
MemoryData       gblocks.24.norm.bias     0 1 gblocks.24.norm.bias 0=64
MemoryData       gblocks.24.norm.weight   0 1 gblocks.24.norm.weight 0=64
MemoryData       gblocks.3.norm.bias      0 1 gblocks.3.norm.bias 0=64
MemoryData       gblocks.3.norm.weight    0 1 gblocks.3.norm.weight 0=64
MemoryData       gblocks.4.norm.bias      0 1 gblocks.4.norm.bias 0=64
MemoryData       gblocks.4.norm.weight    0 1 gblocks.4.norm.weight 0=64
MemoryData       gblocks.5.norm.bias      0 1 gblocks.5.norm.bias 0=64
MemoryData       gblocks.5.norm.weight    0 1 gblocks.5.norm.weight 0=64
MemoryData       gblocks.6.norm.bias      0 1 gblocks.6.norm.bias 0=64
MemoryData       gblocks.6.norm.weight    0 1 gblocks.6.norm.weight 0=64
MemoryData       gblocks.7.norm.bias      0 1 gblocks.7.norm.bias 0=64
MemoryData       gblocks.7.norm.weight    0 1 gblocks.7.norm.weight 0=64
MemoryData       gblocks.8.norm.bias      0 1 gblocks.8.norm.bias 0=64
MemoryData       gblocks.8.norm.weight    0 1 gblocks.8.norm.weight 0=64
MemoryData       gblocks.9.norm.bias      0 1 gblocks.9.norm.bias 0=64
MemoryData       gblocks.9.norm.weight    0 1 gblocks.9.norm.weight 0=64
MemoryData       onnx::Split_230          0 1 onnx::Split_230 0=3
Split            splitncnn_0              1 24 onnx::Split_230 onnx::Split_230_splitncnn_0 onnx::Split_230_splitncnn_1 onnx::Split_230_splitncnn_2 onnx::Split_230_splitncnn_3 onnx::Split_230_splitncnn_4 onnx::Split_230_splitncnn_5 onnx::Split_230_splitncnn_6 onnx::Split_230_splitncnn_7 onnx::Split_230_splitncnn_8 onnx::Split_230_splitncnn_9 onnx::Split_230_splitncnn_10 onnx::Split_230_splitncnn_11 onnx::Split_230_splitncnn_12 onnx::Split_230_splitncnn_13 onnx::Split_230_splitncnn_14 onnx::Split_230_splitncnn_15 onnx::Split_230_splitncnn_16 onnx::Split_230_splitncnn_17 onnx::Split_230_splitncnn_18 onnx::Split_230_splitncnn_19 onnx::Split_230_splitncnn_20 onnx::Split_230_splitncnn_21 onnx::Split_230_splitncnn_22 onnx::Split_230_splitncnn_23
Convolution      /gblocks/gblocks.0/Conv  1 1 input_splitncnn_2 /gblocks/gblocks.0/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728
Split            splitncnn_1              1 3 /gblocks/gblocks.0/Conv_output_0 /gblocks/gblocks.0/Conv_output_0_splitncnn_0 /gblocks/gblocks.0/Conv_output_0_splitncnn_1 /gblocks/gblocks.0/Conv_output_0_splitncnn_2
Reduction        /gblocks/gblocks.1/norm/ReduceMean 1 1 /gblocks/gblocks.0/Conv_output_0_splitncnn_2 /gblocks/gblocks.1/norm/ReduceMean_output_0 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp         /gblocks/gblocks.1/norm/Sub 2 1 /gblocks/gblocks.0/Conv_output_0_splitncnn_1 /gblocks/gblocks.1/norm/ReduceMean_output_0 /gblocks/gblocks.1/norm/Sub_output_0 0=1
Split            splitncnn_2              1 2 /gblocks/gblocks.1/norm/Sub_output_0 /gblocks/gblocks.1/norm/Sub_output_0_splitncnn_0 /gblocks/gblocks.1/norm/Sub_output_0_splitncnn_1
BinaryOp         /gblocks/gblocks.1/norm/Pow 1 1 /gblocks/gblocks.1/norm/Sub_output_0_splitncnn_1 /gblocks/gblocks.1/norm/Pow_output_0 0=6 1=1 2=2.000000e+00
Reduction        /gblocks/gblocks.1/norm/ReduceMean_1 1 1 /gblocks/gblocks.1/norm/Pow_output_0 /gblocks/gblocks.1/norm/ReduceMean_1_output_0 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp         /gblocks/gblocks.1/norm/Add 1 1 /gblocks/gblocks.1/norm/ReduceMean_1_output_0 /gblocks/gblocks.1/norm/Add_output_0 0=0 1=1 2=1.000000e-06
UnaryOp          /gblocks/gblocks.1/norm/Sqrt 1 1 /gblocks/gblocks.1/norm/Add_output_0 /gblocks/gblocks.1/norm/Sqrt_output_0 0=5
BinaryOp         /gblocks/gblocks.1/norm/Div 2 1 /gblocks/gblocks.1/norm/Sub_output_0_splitncnn_0 /gblocks/gblocks.1/norm/Sqrt_output_0 /gblocks/gblocks.1/norm/Div_output_0 0=3
ExpandDims       /gblocks/gblocks.1/norm/Unsqueeze 2 1 gblocks.1.norm.weight /gblocks/gblocks.1/norm/Constant_2_output_0 /gblocks/gblocks.1/norm/Unsqueeze_output_0 -23303=0
ExpandDims       /gblocks/gblocks.1/norm/Unsqueeze_1 2 1 /gblocks/gblocks.1/norm/Unsqueeze_output_0 /gblocks/gblocks.1/norm/Constant_3_output_0 /gblocks/gblocks.1/norm/Unsqueeze_1_output_0 -23303=0
BinaryOp         /gblocks/gblocks.1/norm/Mul 2 1 /gblocks/gblocks.1/norm/Unsqueeze_1_output_0 /gblocks/gblocks.1/norm/Div_output_0 /gblocks/gblocks.1/norm/Mul_output_0 0=2
ExpandDims       /gblocks/gblocks.1/norm/Unsqueeze_2 2 1 gblocks.1.norm.bias /gblocks/gblocks.1/norm/Constant_4_output_0 /gblocks/gblocks.1/norm/Unsqueeze_2_output_0 -23303=0
ExpandDims       /gblocks/gblocks.1/norm/Unsqueeze_3 2 1 /gblocks/gblocks.1/norm/Unsqueeze_2_output_0 /gblocks/gblocks.1/norm/Constant_5_output_0 /gblocks/gblocks.1/norm/Unsqueeze_3_output_0 -23303=0
BinaryOp         /gblocks/gblocks.1/norm/Add_1 2 1 /gblocks/gblocks.1/norm/Mul_output_0 /gblocks/gblocks.1/norm/Unsqueeze_3_output_0 /gblocks/gblocks.1/norm/Add_1_output_0 0=0
Convolution      /gblocks/gblocks.1/fc1/Conv 1 1 /gblocks/gblocks.1/norm/Add_1_output_0 /gblocks/gblocks.1/fc1/Conv_output_0 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=110592
Slice            /gblocks/gblocks.1/Split 2 3 /gblocks/gblocks.1/fc1/Conv_output_0 onnx::Split_230_splitncnn_23 /gblocks/gblocks.1/Split_output_0 /gblocks/gblocks.1/Split_output_1 /gblocks/gblocks.1/Split_output_2 -23300=3,-233,-233,-233 1=0
Split            splitncnn_3              1 2 /gblocks/gblocks.1/Split_output_0 /gblocks/gblocks.1/Split_output_0_splitncnn_0 /gblocks/gblocks.1/Split_output_0_splitncnn_1
ConvolutionDepthWise /gblocks/gblocks.1/conv/Conv 1 1 /gblocks/gblocks.1/Split_output_2 /gblocks/gblocks.1/conv/Conv_output_0 0=64 1=7 11=7 2=1 12=1 3=1 13=1 4=3 14=3 15=3 16=3 5=1 6=3136 7=64
Softplus         /gblocks/gblocks.1/act/Softplus 1 1 /gblocks/gblocks.1/Split_output_0_splitncnn_1 /gblocks/gblocks.1/act/Softplus_output_0
UnaryOp          /gblocks/gblocks.1/act/Tanh 1 1 /gblocks/gblocks.1/act/Softplus_output_0 /gblocks/gblocks.1/act/Tanh_output_0 0=16
BinaryOp         /gblocks/gblocks.1/act/Mul 2 1 /gblocks/gblocks.1/Split_output_0_splitncnn_0 /gblocks/gblocks.1/act/Tanh_output_0 /gblocks/gblocks.1/act/Mul_output_0 0=2
Concat           /gblocks/gblocks.1/Concat 2 1 /gblocks/gblocks.1/Split_output_1 /gblocks/gblocks.1/conv/Conv_output_0 /gblocks/gblocks.1/Concat_output_0 0=0
BinaryOp         /gblocks/gblocks.1/Mul   2 1 /gblocks/gblocks.1/act/Mul_output_0 /gblocks/gblocks.1/Concat_output_0 /gblocks/gblocks.1/Mul_output_0 0=2
Convolution      /gblocks/gblocks.1/fc2/Conv 1 1 /gblocks/gblocks.1/Mul_output_0 /gblocks/gblocks.1/fc2/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=55296
Split            splitncnn_4              1 2 /gblocks/gblocks.1/fc2/Conv_output_0 /gblocks/gblocks.1/fc2/Conv_output_0_splitncnn_0 /gblocks/gblocks.1/fc2/Conv_output_0_splitncnn_1
Softplus         /gblocks/gblocks.1/act_1/Softplus 1 1 /gblocks/gblocks.1/fc2/Conv_output_0_splitncnn_1 /gblocks/gblocks.1/act_1/Softplus_output_0
UnaryOp          /gblocks/gblocks.1/act_1/Tanh 1 1 /gblocks/gblocks.1/act_1/Softplus_output_0 /gblocks/gblocks.1/act_1/Tanh_output_0 0=16
BinaryOp         /gblocks/gblocks.1/act_1/Mul 2 1 /gblocks/gblocks.1/fc2/Conv_output_0_splitncnn_0 /gblocks/gblocks.1/act_1/Tanh_output_0 /gblocks/gblocks.1/act_1/Mul_output_0 0=2
BinaryOp         /gblocks/gblocks.1/Sub   1 1 /gblocks/gblocks.0/Conv_output_0_splitncnn_0 /gblocks/gblocks.1/Sub_output_0 0=1 1=1 2=5.000000e-01
BinaryOp         /gblocks/gblocks.1/Add   2 1 /gblocks/gblocks.1/act_1/Mul_output_0 /gblocks/gblocks.1/Sub_output_0 /gblocks/gblocks.1/Add_output_0 0=0
Split            splitncnn_5              1 3 /gblocks/gblocks.1/Add_output_0 /gblocks/gblocks.1/Add_output_0_splitncnn_0 /gblocks/gblocks.1/Add_output_0_splitncnn_1 /gblocks/gblocks.1/Add_output_0_splitncnn_2
Reduction        /gblocks/gblocks.2/norm/ReduceMean 1 1 /gblocks/gblocks.1/Add_output_0_splitncnn_2 /gblocks/gblocks.2/norm/ReduceMean_output_0 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp         /gblocks/gblocks.2/norm/Sub 2 1 /gblocks/gblocks.1/Add_output_0_splitncnn_1 /gblocks/gblocks.2/norm/ReduceMean_output_0 /gblocks/gblocks.2/norm/Sub_output_0 0=1
Split            splitncnn_6              1 2 /gblocks/gblocks.2/norm/Sub_output_0 /gblocks/gblocks.2/norm/Sub_output_0_splitncnn_0 /gblocks/gblocks.2/norm/Sub_output_0_splitncnn_1
BinaryOp         /gblocks/gblocks.2/norm/Pow 1 1 /gblocks/gblocks.2/norm/Sub_output_0_splitncnn_1 /gblocks/gblocks.2/norm/Pow_output_0 0=6 1=1 2=2.000000e+00
Reduction        /gblocks/gblocks.2/norm/ReduceMean_1 1 1 /gblocks/gblocks.2/norm/Pow_output_0 /gblocks/gblocks.2/norm/ReduceMean_1_output_0 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp         /gblocks/gblocks.2/norm/Add 1 1 /gblocks/gblocks.2/norm/ReduceMean_1_output_0 /gblocks/gblocks.2/norm/Add_output_0 0=0 1=1 2=1.000000e-06
UnaryOp          /gblocks/gblocks.2/norm/Sqrt 1 1 /gblocks/gblocks.2/norm/Add_output_0 /gblocks/gblocks.2/norm/Sqrt_output_0 0=5
BinaryOp         /gblocks/gblocks.2/norm/Div 2 1 /gblocks/gblocks.2/norm/Sub_output_0_splitncnn_0 /gblocks/gblocks.2/norm/Sqrt_output_0 /gblocks/gblocks.2/norm/Div_output_0 0=3
ExpandDims       /gblocks/gblocks.2/norm/Unsqueeze 2 1 gblocks.2.norm.weight /gblocks/gblocks.2/norm/Constant_2_output_0 /gblocks/gblocks.2/norm/Unsqueeze_output_0 -23303=0
ExpandDims       /gblocks/gblocks.2/norm/Unsqueeze_1 2 1 /gblocks/gblocks.2/norm/Unsqueeze_output_0 /gblocks/gblocks.2/norm/Constant_3_output_0 /gblocks/gblocks.2/norm/Unsqueeze_1_output_0 -23303=0
BinaryOp         /gblocks/gblocks.2/norm/Mul 2 1 /gblocks/gblocks.2/norm/Unsqueeze_1_output_0 /gblocks/gblocks.2/norm/Div_output_0 /gblocks/gblocks.2/norm/Mul_output_0 0=2
ExpandDims       /gblocks/gblocks.2/norm/Unsqueeze_2 2 1 gblocks.2.norm.bias /gblocks/gblocks.2/norm/Constant_4_output_0 /gblocks/gblocks.2/norm/Unsqueeze_2_output_0 -23303=0
ExpandDims       /gblocks/gblocks.2/norm/Unsqueeze_3 2 1 /gblocks/gblocks.2/norm/Unsqueeze_2_output_0 /gblocks/gblocks.2/norm/Constant_5_output_0 /gblocks/gblocks.2/norm/Unsqueeze_3_output_0 -23303=0
BinaryOp         /gblocks/gblocks.2/norm/Add_1 2 1 /gblocks/gblocks.2/norm/Mul_output_0 /gblocks/gblocks.2/norm/Unsqueeze_3_output_0 /gblocks/gblocks.2/norm/Add_1_output_0 0=0
Convolution      /gblocks/gblocks.2/fc1/Conv 1 1 /gblocks/gblocks.2/norm/Add_1_output_0 /gblocks/gblocks.2/fc1/Conv_output_0 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=110592
Slice            /gblocks/gblocks.2/Split 2 3 /gblocks/gblocks.2/fc1/Conv_output_0 onnx::Split_230_splitncnn_22 /gblocks/gblocks.2/Split_output_0 /gblocks/gblocks.2/Split_output_1 /gblocks/gblocks.2/Split_output_2 -23300=3,-233,-233,-233 1=0
Split            splitncnn_7              1 2 /gblocks/gblocks.2/Split_output_0 /gblocks/gblocks.2/Split_output_0_splitncnn_0 /gblocks/gblocks.2/Split_output_0_splitncnn_1
ConvolutionDepthWise /gblocks/gblocks.2/conv/Conv 1 1 /gblocks/gblocks.2/Split_output_2 /gblocks/gblocks.2/conv/Conv_output_0 0=64 1=7 11=7 2=1 12=1 3=1 13=1 4=3 14=3 15=3 16=3 5=1 6=3136 7=64
Softplus         /gblocks/gblocks.2/act/Softplus 1 1 /gblocks/gblocks.2/Split_output_0_splitncnn_1 /gblocks/gblocks.2/act/Softplus_output_0
UnaryOp          /gblocks/gblocks.2/act/Tanh 1 1 /gblocks/gblocks.2/act/Softplus_output_0 /gblocks/gblocks.2/act/Tanh_output_0 0=16
BinaryOp         /gblocks/gblocks.2/act/Mul 2 1 /gblocks/gblocks.2/Split_output_0_splitncnn_0 /gblocks/gblocks.2/act/Tanh_output_0 /gblocks/gblocks.2/act/Mul_output_0 0=2
Concat           /gblocks/gblocks.2/Concat 2 1 /gblocks/gblocks.2/Split_output_1 /gblocks/gblocks.2/conv/Conv_output_0 /gblocks/gblocks.2/Concat_output_0 0=0
BinaryOp         /gblocks/gblocks.2/Mul   2 1 /gblocks/gblocks.2/act/Mul_output_0 /gblocks/gblocks.2/Concat_output_0 /gblocks/gblocks.2/Mul_output_0 0=2
Convolution      /gblocks/gblocks.2/fc2/Conv 1 1 /gblocks/gblocks.2/Mul_output_0 /gblocks/gblocks.2/fc2/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=55296
Split            splitncnn_8              1 2 /gblocks/gblocks.2/fc2/Conv_output_0 /gblocks/gblocks.2/fc2/Conv_output_0_splitncnn_0 /gblocks/gblocks.2/fc2/Conv_output_0_splitncnn_1
Softplus         /gblocks/gblocks.2/act_1/Softplus 1 1 /gblocks/gblocks.2/fc2/Conv_output_0_splitncnn_1 /gblocks/gblocks.2/act_1/Softplus_output_0
UnaryOp          /gblocks/gblocks.2/act_1/Tanh 1 1 /gblocks/gblocks.2/act_1/Softplus_output_0 /gblocks/gblocks.2/act_1/Tanh_output_0 0=16
BinaryOp         /gblocks/gblocks.2/act_1/Mul 2 1 /gblocks/gblocks.2/fc2/Conv_output_0_splitncnn_0 /gblocks/gblocks.2/act_1/Tanh_output_0 /gblocks/gblocks.2/act_1/Mul_output_0 0=2
BinaryOp         /gblocks/gblocks.2/Sub   1 1 /gblocks/gblocks.1/Add_output_0_splitncnn_0 /gblocks/gblocks.2/Sub_output_0 0=1 1=1 2=5.000000e-01
BinaryOp         /gblocks/gblocks.2/Add   2 1 /gblocks/gblocks.2/act_1/Mul_output_0 /gblocks/gblocks.2/Sub_output_0 /gblocks/gblocks.2/Add_output_0 0=0
Split            splitncnn_9              1 3 /gblocks/gblocks.2/Add_output_0 /gblocks/gblocks.2/Add_output_0_splitncnn_0 /gblocks/gblocks.2/Add_output_0_splitncnn_1 /gblocks/gblocks.2/Add_output_0_splitncnn_2
Reduction        /gblocks/gblocks.3/norm/ReduceMean 1 1 /gblocks/gblocks.2/Add_output_0_splitncnn_2 /gblocks/gblocks.3/norm/ReduceMean_output_0 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp         /gblocks/gblocks.3/norm/Sub 2 1 /gblocks/gblocks.2/Add_output_0_splitncnn_1 /gblocks/gblocks.3/norm/ReduceMean_output_0 /gblocks/gblocks.3/norm/Sub_output_0 0=1
Split            splitncnn_10             1 2 /gblocks/gblocks.3/norm/Sub_output_0 /gblocks/gblocks.3/norm/Sub_output_0_splitncnn_0 /gblocks/gblocks.3/norm/Sub_output_0_splitncnn_1
BinaryOp         /gblocks/gblocks.3/norm/Pow 1 1 /gblocks/gblocks.3/norm/Sub_output_0_splitncnn_1 /gblocks/gblocks.3/norm/Pow_output_0 0=6 1=1 2=2.000000e+00
Reduction        /gblocks/gblocks.3/norm/ReduceMean_1 1 1 /gblocks/gblocks.3/norm/Pow_output_0 /gblocks/gblocks.3/norm/ReduceMean_1_output_0 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp         /gblocks/gblocks.3/norm/Add 1 1 /gblocks/gblocks.3/norm/ReduceMean_1_output_0 /gblocks/gblocks.3/norm/Add_output_0 0=0 1=1 2=1.000000e-06
UnaryOp          /gblocks/gblocks.3/norm/Sqrt 1 1 /gblocks/gblocks.3/norm/Add_output_0 /gblocks/gblocks.3/norm/Sqrt_output_0 0=5
BinaryOp         /gblocks/gblocks.3/norm/Div 2 1 /gblocks/gblocks.3/norm/Sub_output_0_splitncnn_0 /gblocks/gblocks.3/norm/Sqrt_output_0 /gblocks/gblocks.3/norm/Div_output_0 0=3
ExpandDims       /gblocks/gblocks.3/norm/Unsqueeze 2 1 gblocks.3.norm.weight /gblocks/gblocks.3/norm/Constant_2_output_0 /gblocks/gblocks.3/norm/Unsqueeze_output_0 -23303=0
ExpandDims       /gblocks/gblocks.3/norm/Unsqueeze_1 2 1 /gblocks/gblocks.3/norm/Unsqueeze_output_0 /gblocks/gblocks.3/norm/Constant_3_output_0 /gblocks/gblocks.3/norm/Unsqueeze_1_output_0 -23303=0
BinaryOp         /gblocks/gblocks.3/norm/Mul 2 1 /gblocks/gblocks.3/norm/Unsqueeze_1_output_0 /gblocks/gblocks.3/norm/Div_output_0 /gblocks/gblocks.3/norm/Mul_output_0 0=2
ExpandDims       /gblocks/gblocks.3/norm/Unsqueeze_2 2 1 gblocks.3.norm.bias /gblocks/gblocks.3/norm/Constant_4_output_0 /gblocks/gblocks.3/norm/Unsqueeze_2_output_0 -23303=0
ExpandDims       /gblocks/gblocks.3/norm/Unsqueeze_3 2 1 /gblocks/gblocks.3/norm/Unsqueeze_2_output_0 /gblocks/gblocks.3/norm/Constant_5_output_0 /gblocks/gblocks.3/norm/Unsqueeze_3_output_0 -23303=0
BinaryOp         /gblocks/gblocks.3/norm/Add_1 2 1 /gblocks/gblocks.3/norm/Mul_output_0 /gblocks/gblocks.3/norm/Unsqueeze_3_output_0 /gblocks/gblocks.3/norm/Add_1_output_0 0=0
Convolution      /gblocks/gblocks.3/fc1/Conv 1 1 /gblocks/gblocks.3/norm/Add_1_output_0 /gblocks/gblocks.3/fc1/Conv_output_0 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=110592
Slice            /gblocks/gblocks.3/Split 2 3 /gblocks/gblocks.3/fc1/Conv_output_0 onnx::Split_230_splitncnn_21 /gblocks/gblocks.3/Split_output_0 /gblocks/gblocks.3/Split_output_1 /gblocks/gblocks.3/Split_output_2 -23300=3,-233,-233,-233 1=0
Split            splitncnn_11             1 2 /gblocks/gblocks.3/Split_output_0 /gblocks/gblocks.3/Split_output_0_splitncnn_0 /gblocks/gblocks.3/Split_output_0_splitncnn_1
ConvolutionDepthWise /gblocks/gblocks.3/conv/Conv 1 1 /gblocks/gblocks.3/Split_output_2 /gblocks/gblocks.3/conv/Conv_output_0 0=64 1=7 11=7 2=1 12=1 3=1 13=1 4=3 14=3 15=3 16=3 5=1 6=3136 7=64
Softplus         /gblocks/gblocks.3/act/Softplus 1 1 /gblocks/gblocks.3/Split_output_0_splitncnn_1 /gblocks/gblocks.3/act/Softplus_output_0
UnaryOp          /gblocks/gblocks.3/act/Tanh 1 1 /gblocks/gblocks.3/act/Softplus_output_0 /gblocks/gblocks.3/act/Tanh_output_0 0=16
BinaryOp         /gblocks/gblocks.3/act/Mul 2 1 /gblocks/gblocks.3/Split_output_0_splitncnn_0 /gblocks/gblocks.3/act/Tanh_output_0 /gblocks/gblocks.3/act/Mul_output_0 0=2
Concat           /gblocks/gblocks.3/Concat 2 1 /gblocks/gblocks.3/Split_output_1 /gblocks/gblocks.3/conv/Conv_output_0 /gblocks/gblocks.3/Concat_output_0 0=0
BinaryOp         /gblocks/gblocks.3/Mul   2 1 /gblocks/gblocks.3/act/Mul_output_0 /gblocks/gblocks.3/Concat_output_0 /gblocks/gblocks.3/Mul_output_0 0=2
Convolution      /gblocks/gblocks.3/fc2/Conv 1 1 /gblocks/gblocks.3/Mul_output_0 /gblocks/gblocks.3/fc2/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=55296
Split            splitncnn_12             1 2 /gblocks/gblocks.3/fc2/Conv_output_0 /gblocks/gblocks.3/fc2/Conv_output_0_splitncnn_0 /gblocks/gblocks.3/fc2/Conv_output_0_splitncnn_1
Softplus         /gblocks/gblocks.3/act_1/Softplus 1 1 /gblocks/gblocks.3/fc2/Conv_output_0_splitncnn_1 /gblocks/gblocks.3/act_1/Softplus_output_0
UnaryOp          /gblocks/gblocks.3/act_1/Tanh 1 1 /gblocks/gblocks.3/act_1/Softplus_output_0 /gblocks/gblocks.3/act_1/Tanh_output_0 0=16
BinaryOp         /gblocks/gblocks.3/act_1/Mul 2 1 /gblocks/gblocks.3/fc2/Conv_output_0_splitncnn_0 /gblocks/gblocks.3/act_1/Tanh_output_0 /gblocks/gblocks.3/act_1/Mul_output_0 0=2
BinaryOp         /gblocks/gblocks.3/Sub   1 1 /gblocks/gblocks.2/Add_output_0_splitncnn_0 /gblocks/gblocks.3/Sub_output_0 0=1 1=1 2=5.000000e-01
BinaryOp         /gblocks/gblocks.3/Add   2 1 /gblocks/gblocks.3/act_1/Mul_output_0 /gblocks/gblocks.3/Sub_output_0 /gblocks/gblocks.3/Add_output_0 0=0
Split            splitncnn_13             1 3 /gblocks/gblocks.3/Add_output_0 /gblocks/gblocks.3/Add_output_0_splitncnn_0 /gblocks/gblocks.3/Add_output_0_splitncnn_1 /gblocks/gblocks.3/Add_output_0_splitncnn_2
Reduction        /gblocks/gblocks.4/norm/ReduceMean 1 1 /gblocks/gblocks.3/Add_output_0_splitncnn_2 /gblocks/gblocks.4/norm/ReduceMean_output_0 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp         /gblocks/gblocks.4/norm/Sub 2 1 /gblocks/gblocks.3/Add_output_0_splitncnn_1 /gblocks/gblocks.4/norm/ReduceMean_output_0 /gblocks/gblocks.4/norm/Sub_output_0 0=1
Split            splitncnn_14             1 2 /gblocks/gblocks.4/norm/Sub_output_0 /gblocks/gblocks.4/norm/Sub_output_0_splitncnn_0 /gblocks/gblocks.4/norm/Sub_output_0_splitncnn_1
BinaryOp         /gblocks/gblocks.4/norm/Pow 1 1 /gblocks/gblocks.4/norm/Sub_output_0_splitncnn_1 /gblocks/gblocks.4/norm/Pow_output_0 0=6 1=1 2=2.000000e+00
Reduction        /gblocks/gblocks.4/norm/ReduceMean_1 1 1 /gblocks/gblocks.4/norm/Pow_output_0 /gblocks/gblocks.4/norm/ReduceMean_1_output_0 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp         /gblocks/gblocks.4/norm/Add 1 1 /gblocks/gblocks.4/norm/ReduceMean_1_output_0 /gblocks/gblocks.4/norm/Add_output_0 0=0 1=1 2=1.000000e-06
UnaryOp          /gblocks/gblocks.4/norm/Sqrt 1 1 /gblocks/gblocks.4/norm/Add_output_0 /gblocks/gblocks.4/norm/Sqrt_output_0 0=5
BinaryOp         /gblocks/gblocks.4/norm/Div 2 1 /gblocks/gblocks.4/norm/Sub_output_0_splitncnn_0 /gblocks/gblocks.4/norm/Sqrt_output_0 /gblocks/gblocks.4/norm/Div_output_0 0=3
ExpandDims       /gblocks/gblocks.4/norm/Unsqueeze 2 1 gblocks.4.norm.weight /gblocks/gblocks.4/norm/Constant_2_output_0 /gblocks/gblocks.4/norm/Unsqueeze_output_0 -23303=0
ExpandDims       /gblocks/gblocks.4/norm/Unsqueeze_1 2 1 /gblocks/gblocks.4/norm/Unsqueeze_output_0 /gblocks/gblocks.4/norm/Constant_3_output_0 /gblocks/gblocks.4/norm/Unsqueeze_1_output_0 -23303=0
BinaryOp         /gblocks/gblocks.4/norm/Mul 2 1 /gblocks/gblocks.4/norm/Unsqueeze_1_output_0 /gblocks/gblocks.4/norm/Div_output_0 /gblocks/gblocks.4/norm/Mul_output_0 0=2
ExpandDims       /gblocks/gblocks.4/norm/Unsqueeze_2 2 1 gblocks.4.norm.bias /gblocks/gblocks.4/norm/Constant_4_output_0 /gblocks/gblocks.4/norm/Unsqueeze_2_output_0 -23303=0
ExpandDims       /gblocks/gblocks.4/norm/Unsqueeze_3 2 1 /gblocks/gblocks.4/norm/Unsqueeze_2_output_0 /gblocks/gblocks.4/norm/Constant_5_output_0 /gblocks/gblocks.4/norm/Unsqueeze_3_output_0 -23303=0
BinaryOp         /gblocks/gblocks.4/norm/Add_1 2 1 /gblocks/gblocks.4/norm/Mul_output_0 /gblocks/gblocks.4/norm/Unsqueeze_3_output_0 /gblocks/gblocks.4/norm/Add_1_output_0 0=0
Convolution      /gblocks/gblocks.4/fc1/Conv 1 1 /gblocks/gblocks.4/norm/Add_1_output_0 /gblocks/gblocks.4/fc1/Conv_output_0 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=110592
Slice            /gblocks/gblocks.4/Split 2 3 /gblocks/gblocks.4/fc1/Conv_output_0 onnx::Split_230_splitncnn_20 /gblocks/gblocks.4/Split_output_0 /gblocks/gblocks.4/Split_output_1 /gblocks/gblocks.4/Split_output_2 -23300=3,-233,-233,-233 1=0
Split            splitncnn_15             1 2 /gblocks/gblocks.4/Split_output_0 /gblocks/gblocks.4/Split_output_0_splitncnn_0 /gblocks/gblocks.4/Split_output_0_splitncnn_1
ConvolutionDepthWise /gblocks/gblocks.4/conv/Conv 1 1 /gblocks/gblocks.4/Split_output_2 /gblocks/gblocks.4/conv/Conv_output_0 0=64 1=7 11=7 2=1 12=1 3=1 13=1 4=3 14=3 15=3 16=3 5=1 6=3136 7=64
Softplus         /gblocks/gblocks.4/act/Softplus 1 1 /gblocks/gblocks.4/Split_output_0_splitncnn_1 /gblocks/gblocks.4/act/Softplus_output_0
UnaryOp          /gblocks/gblocks.4/act/Tanh 1 1 /gblocks/gblocks.4/act/Softplus_output_0 /gblocks/gblocks.4/act/Tanh_output_0 0=16
BinaryOp         /gblocks/gblocks.4/act/Mul 2 1 /gblocks/gblocks.4/Split_output_0_splitncnn_0 /gblocks/gblocks.4/act/Tanh_output_0 /gblocks/gblocks.4/act/Mul_output_0 0=2
Concat           /gblocks/gblocks.4/Concat 2 1 /gblocks/gblocks.4/Split_output_1 /gblocks/gblocks.4/conv/Conv_output_0 /gblocks/gblocks.4/Concat_output_0 0=0
BinaryOp         /gblocks/gblocks.4/Mul   2 1 /gblocks/gblocks.4/act/Mul_output_0 /gblocks/gblocks.4/Concat_output_0 /gblocks/gblocks.4/Mul_output_0 0=2
Convolution      /gblocks/gblocks.4/fc2/Conv 1 1 /gblocks/gblocks.4/Mul_output_0 /gblocks/gblocks.4/fc2/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=55296
Split            splitncnn_16             1 2 /gblocks/gblocks.4/fc2/Conv_output_0 /gblocks/gblocks.4/fc2/Conv_output_0_splitncnn_0 /gblocks/gblocks.4/fc2/Conv_output_0_splitncnn_1
Softplus         /gblocks/gblocks.4/act_1/Softplus 1 1 /gblocks/gblocks.4/fc2/Conv_output_0_splitncnn_1 /gblocks/gblocks.4/act_1/Softplus_output_0
UnaryOp          /gblocks/gblocks.4/act_1/Tanh 1 1 /gblocks/gblocks.4/act_1/Softplus_output_0 /gblocks/gblocks.4/act_1/Tanh_output_0 0=16
BinaryOp         /gblocks/gblocks.4/act_1/Mul 2 1 /gblocks/gblocks.4/fc2/Conv_output_0_splitncnn_0 /gblocks/gblocks.4/act_1/Tanh_output_0 /gblocks/gblocks.4/act_1/Mul_output_0 0=2
BinaryOp         /gblocks/gblocks.4/Sub   1 1 /gblocks/gblocks.3/Add_output_0_splitncnn_0 /gblocks/gblocks.4/Sub_output_0 0=1 1=1 2=5.000000e-01
BinaryOp         /gblocks/gblocks.4/Add   2 1 /gblocks/gblocks.4/act_1/Mul_output_0 /gblocks/gblocks.4/Sub_output_0 /gblocks/gblocks.4/Add_output_0 0=0
Split            splitncnn_17             1 3 /gblocks/gblocks.4/Add_output_0 /gblocks/gblocks.4/Add_output_0_splitncnn_0 /gblocks/gblocks.4/Add_output_0_splitncnn_1 /gblocks/gblocks.4/Add_output_0_splitncnn_2
Reduction        /gblocks/gblocks.5/norm/ReduceMean 1 1 /gblocks/gblocks.4/Add_output_0_splitncnn_2 /gblocks/gblocks.5/norm/ReduceMean_output_0 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp         /gblocks/gblocks.5/norm/Sub 2 1 /gblocks/gblocks.4/Add_output_0_splitncnn_1 /gblocks/gblocks.5/norm/ReduceMean_output_0 /gblocks/gblocks.5/norm/Sub_output_0 0=1
Split            splitncnn_18             1 2 /gblocks/gblocks.5/norm/Sub_output_0 /gblocks/gblocks.5/norm/Sub_output_0_splitncnn_0 /gblocks/gblocks.5/norm/Sub_output_0_splitncnn_1
BinaryOp         /gblocks/gblocks.5/norm/Pow 1 1 /gblocks/gblocks.5/norm/Sub_output_0_splitncnn_1 /gblocks/gblocks.5/norm/Pow_output_0 0=6 1=1 2=2.000000e+00
Reduction        /gblocks/gblocks.5/norm/ReduceMean_1 1 1 /gblocks/gblocks.5/norm/Pow_output_0 /gblocks/gblocks.5/norm/ReduceMean_1_output_0 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp         /gblocks/gblocks.5/norm/Add 1 1 /gblocks/gblocks.5/norm/ReduceMean_1_output_0 /gblocks/gblocks.5/norm/Add_output_0 0=0 1=1 2=1.000000e-06
UnaryOp          /gblocks/gblocks.5/norm/Sqrt 1 1 /gblocks/gblocks.5/norm/Add_output_0 /gblocks/gblocks.5/norm/Sqrt_output_0 0=5
BinaryOp         /gblocks/gblocks.5/norm/Div 2 1 /gblocks/gblocks.5/norm/Sub_output_0_splitncnn_0 /gblocks/gblocks.5/norm/Sqrt_output_0 /gblocks/gblocks.5/norm/Div_output_0 0=3
ExpandDims       /gblocks/gblocks.5/norm/Unsqueeze 2 1 gblocks.5.norm.weight /gblocks/gblocks.5/norm/Constant_2_output_0 /gblocks/gblocks.5/norm/Unsqueeze_output_0 -23303=0
ExpandDims       /gblocks/gblocks.5/norm/Unsqueeze_1 2 1 /gblocks/gblocks.5/norm/Unsqueeze_output_0 /gblocks/gblocks.5/norm/Constant_3_output_0 /gblocks/gblocks.5/norm/Unsqueeze_1_output_0 -23303=0
BinaryOp         /gblocks/gblocks.5/norm/Mul 2 1 /gblocks/gblocks.5/norm/Unsqueeze_1_output_0 /gblocks/gblocks.5/norm/Div_output_0 /gblocks/gblocks.5/norm/Mul_output_0 0=2
ExpandDims       /gblocks/gblocks.5/norm/Unsqueeze_2 2 1 gblocks.5.norm.bias /gblocks/gblocks.5/norm/Constant_4_output_0 /gblocks/gblocks.5/norm/Unsqueeze_2_output_0 -23303=0
ExpandDims       /gblocks/gblocks.5/norm/Unsqueeze_3 2 1 /gblocks/gblocks.5/norm/Unsqueeze_2_output_0 /gblocks/gblocks.5/norm/Constant_5_output_0 /gblocks/gblocks.5/norm/Unsqueeze_3_output_0 -23303=0
BinaryOp         /gblocks/gblocks.5/norm/Add_1 2 1 /gblocks/gblocks.5/norm/Mul_output_0 /gblocks/gblocks.5/norm/Unsqueeze_3_output_0 /gblocks/gblocks.5/norm/Add_1_output_0 0=0
Convolution      /gblocks/gblocks.5/fc1/Conv 1 1 /gblocks/gblocks.5/norm/Add_1_output_0 /gblocks/gblocks.5/fc1/Conv_output_0 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=110592
Slice            /gblocks/gblocks.5/Split 2 3 /gblocks/gblocks.5/fc1/Conv_output_0 onnx::Split_230_splitncnn_19 /gblocks/gblocks.5/Split_output_0 /gblocks/gblocks.5/Split_output_1 /gblocks/gblocks.5/Split_output_2 -23300=3,-233,-233,-233 1=0
Split            splitncnn_19             1 2 /gblocks/gblocks.5/Split_output_0 /gblocks/gblocks.5/Split_output_0_splitncnn_0 /gblocks/gblocks.5/Split_output_0_splitncnn_1
ConvolutionDepthWise /gblocks/gblocks.5/conv/Conv 1 1 /gblocks/gblocks.5/Split_output_2 /gblocks/gblocks.5/conv/Conv_output_0 0=64 1=7 11=7 2=1 12=1 3=1 13=1 4=3 14=3 15=3 16=3 5=1 6=3136 7=64
Softplus         /gblocks/gblocks.5/act/Softplus 1 1 /gblocks/gblocks.5/Split_output_0_splitncnn_1 /gblocks/gblocks.5/act/Softplus_output_0
UnaryOp          /gblocks/gblocks.5/act/Tanh 1 1 /gblocks/gblocks.5/act/Softplus_output_0 /gblocks/gblocks.5/act/Tanh_output_0 0=16
BinaryOp         /gblocks/gblocks.5/act/Mul 2 1 /gblocks/gblocks.5/Split_output_0_splitncnn_0 /gblocks/gblocks.5/act/Tanh_output_0 /gblocks/gblocks.5/act/Mul_output_0 0=2
Concat           /gblocks/gblocks.5/Concat 2 1 /gblocks/gblocks.5/Split_output_1 /gblocks/gblocks.5/conv/Conv_output_0 /gblocks/gblocks.5/Concat_output_0 0=0
BinaryOp         /gblocks/gblocks.5/Mul   2 1 /gblocks/gblocks.5/act/Mul_output_0 /gblocks/gblocks.5/Concat_output_0 /gblocks/gblocks.5/Mul_output_0 0=2
Convolution      /gblocks/gblocks.5/fc2/Conv 1 1 /gblocks/gblocks.5/Mul_output_0 /gblocks/gblocks.5/fc2/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=55296
Split            splitncnn_20             1 2 /gblocks/gblocks.5/fc2/Conv_output_0 /gblocks/gblocks.5/fc2/Conv_output_0_splitncnn_0 /gblocks/gblocks.5/fc2/Conv_output_0_splitncnn_1
Softplus         /gblocks/gblocks.5/act_1/Softplus 1 1 /gblocks/gblocks.5/fc2/Conv_output_0_splitncnn_1 /gblocks/gblocks.5/act_1/Softplus_output_0
UnaryOp          /gblocks/gblocks.5/act_1/Tanh 1 1 /gblocks/gblocks.5/act_1/Softplus_output_0 /gblocks/gblocks.5/act_1/Tanh_output_0 0=16
BinaryOp         /gblocks/gblocks.5/act_1/Mul 2 1 /gblocks/gblocks.5/fc2/Conv_output_0_splitncnn_0 /gblocks/gblocks.5/act_1/Tanh_output_0 /gblocks/gblocks.5/act_1/Mul_output_0 0=2
BinaryOp         /gblocks/gblocks.5/Sub   1 1 /gblocks/gblocks.4/Add_output_0_splitncnn_0 /gblocks/gblocks.5/Sub_output_0 0=1 1=1 2=5.000000e-01
BinaryOp         /gblocks/gblocks.5/Add   2 1 /gblocks/gblocks.5/act_1/Mul_output_0 /gblocks/gblocks.5/Sub_output_0 /gblocks/gblocks.5/Add_output_0 0=0
Split            splitncnn_21             1 3 /gblocks/gblocks.5/Add_output_0 /gblocks/gblocks.5/Add_output_0_splitncnn_0 /gblocks/gblocks.5/Add_output_0_splitncnn_1 /gblocks/gblocks.5/Add_output_0_splitncnn_2
Reduction        /gblocks/gblocks.6/norm/ReduceMean 1 1 /gblocks/gblocks.5/Add_output_0_splitncnn_2 /gblocks/gblocks.6/norm/ReduceMean_output_0 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp         /gblocks/gblocks.6/norm/Sub 2 1 /gblocks/gblocks.5/Add_output_0_splitncnn_1 /gblocks/gblocks.6/norm/ReduceMean_output_0 /gblocks/gblocks.6/norm/Sub_output_0 0=1
Split            splitncnn_22             1 2 /gblocks/gblocks.6/norm/Sub_output_0 /gblocks/gblocks.6/norm/Sub_output_0_splitncnn_0 /gblocks/gblocks.6/norm/Sub_output_0_splitncnn_1
BinaryOp         /gblocks/gblocks.6/norm/Pow 1 1 /gblocks/gblocks.6/norm/Sub_output_0_splitncnn_1 /gblocks/gblocks.6/norm/Pow_output_0 0=6 1=1 2=2.000000e+00
Reduction        /gblocks/gblocks.6/norm/ReduceMean_1 1 1 /gblocks/gblocks.6/norm/Pow_output_0 /gblocks/gblocks.6/norm/ReduceMean_1_output_0 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp         /gblocks/gblocks.6/norm/Add 1 1 /gblocks/gblocks.6/norm/ReduceMean_1_output_0 /gblocks/gblocks.6/norm/Add_output_0 0=0 1=1 2=1.000000e-06
UnaryOp          /gblocks/gblocks.6/norm/Sqrt 1 1 /gblocks/gblocks.6/norm/Add_output_0 /gblocks/gblocks.6/norm/Sqrt_output_0 0=5
BinaryOp         /gblocks/gblocks.6/norm/Div 2 1 /gblocks/gblocks.6/norm/Sub_output_0_splitncnn_0 /gblocks/gblocks.6/norm/Sqrt_output_0 /gblocks/gblocks.6/norm/Div_output_0 0=3
ExpandDims       /gblocks/gblocks.6/norm/Unsqueeze 2 1 gblocks.6.norm.weight /gblocks/gblocks.6/norm/Constant_2_output_0 /gblocks/gblocks.6/norm/Unsqueeze_output_0 -23303=0
ExpandDims       /gblocks/gblocks.6/norm/Unsqueeze_1 2 1 /gblocks/gblocks.6/norm/Unsqueeze_output_0 /gblocks/gblocks.6/norm/Constant_3_output_0 /gblocks/gblocks.6/norm/Unsqueeze_1_output_0 -23303=0
BinaryOp         /gblocks/gblocks.6/norm/Mul 2 1 /gblocks/gblocks.6/norm/Unsqueeze_1_output_0 /gblocks/gblocks.6/norm/Div_output_0 /gblocks/gblocks.6/norm/Mul_output_0 0=2
ExpandDims       /gblocks/gblocks.6/norm/Unsqueeze_2 2 1 gblocks.6.norm.bias /gblocks/gblocks.6/norm/Constant_4_output_0 /gblocks/gblocks.6/norm/Unsqueeze_2_output_0 -23303=0
ExpandDims       /gblocks/gblocks.6/norm/Unsqueeze_3 2 1 /gblocks/gblocks.6/norm/Unsqueeze_2_output_0 /gblocks/gblocks.6/norm/Constant_5_output_0 /gblocks/gblocks.6/norm/Unsqueeze_3_output_0 -23303=0
BinaryOp         /gblocks/gblocks.6/norm/Add_1 2 1 /gblocks/gblocks.6/norm/Mul_output_0 /gblocks/gblocks.6/norm/Unsqueeze_3_output_0 /gblocks/gblocks.6/norm/Add_1_output_0 0=0
Convolution      /gblocks/gblocks.6/fc1/Conv 1 1 /gblocks/gblocks.6/norm/Add_1_output_0 /gblocks/gblocks.6/fc1/Conv_output_0 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=110592
Slice            /gblocks/gblocks.6/Split 2 3 /gblocks/gblocks.6/fc1/Conv_output_0 onnx::Split_230_splitncnn_18 /gblocks/gblocks.6/Split_output_0 /gblocks/gblocks.6/Split_output_1 /gblocks/gblocks.6/Split_output_2 -23300=3,-233,-233,-233 1=0
Split            splitncnn_23             1 2 /gblocks/gblocks.6/Split_output_0 /gblocks/gblocks.6/Split_output_0_splitncnn_0 /gblocks/gblocks.6/Split_output_0_splitncnn_1
ConvolutionDepthWise /gblocks/gblocks.6/conv/Conv 1 1 /gblocks/gblocks.6/Split_output_2 /gblocks/gblocks.6/conv/Conv_output_0 0=64 1=7 11=7 2=1 12=1 3=1 13=1 4=3 14=3 15=3 16=3 5=1 6=3136 7=64
Softplus         /gblocks/gblocks.6/act/Softplus 1 1 /gblocks/gblocks.6/Split_output_0_splitncnn_1 /gblocks/gblocks.6/act/Softplus_output_0
UnaryOp          /gblocks/gblocks.6/act/Tanh 1 1 /gblocks/gblocks.6/act/Softplus_output_0 /gblocks/gblocks.6/act/Tanh_output_0 0=16
BinaryOp         /gblocks/gblocks.6/act/Mul 2 1 /gblocks/gblocks.6/Split_output_0_splitncnn_0 /gblocks/gblocks.6/act/Tanh_output_0 /gblocks/gblocks.6/act/Mul_output_0 0=2
Concat           /gblocks/gblocks.6/Concat 2 1 /gblocks/gblocks.6/Split_output_1 /gblocks/gblocks.6/conv/Conv_output_0 /gblocks/gblocks.6/Concat_output_0 0=0
BinaryOp         /gblocks/gblocks.6/Mul   2 1 /gblocks/gblocks.6/act/Mul_output_0 /gblocks/gblocks.6/Concat_output_0 /gblocks/gblocks.6/Mul_output_0 0=2
Convolution      /gblocks/gblocks.6/fc2/Conv 1 1 /gblocks/gblocks.6/Mul_output_0 /gblocks/gblocks.6/fc2/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=55296
Split            splitncnn_24             1 2 /gblocks/gblocks.6/fc2/Conv_output_0 /gblocks/gblocks.6/fc2/Conv_output_0_splitncnn_0 /gblocks/gblocks.6/fc2/Conv_output_0_splitncnn_1
Softplus         /gblocks/gblocks.6/act_1/Softplus 1 1 /gblocks/gblocks.6/fc2/Conv_output_0_splitncnn_1 /gblocks/gblocks.6/act_1/Softplus_output_0
UnaryOp          /gblocks/gblocks.6/act_1/Tanh 1 1 /gblocks/gblocks.6/act_1/Softplus_output_0 /gblocks/gblocks.6/act_1/Tanh_output_0 0=16
BinaryOp         /gblocks/gblocks.6/act_1/Mul 2 1 /gblocks/gblocks.6/fc2/Conv_output_0_splitncnn_0 /gblocks/gblocks.6/act_1/Tanh_output_0 /gblocks/gblocks.6/act_1/Mul_output_0 0=2
BinaryOp         /gblocks/gblocks.6/Sub   1 1 /gblocks/gblocks.5/Add_output_0_splitncnn_0 /gblocks/gblocks.6/Sub_output_0 0=1 1=1 2=5.000000e-01
BinaryOp         /gblocks/gblocks.6/Add   2 1 /gblocks/gblocks.6/act_1/Mul_output_0 /gblocks/gblocks.6/Sub_output_0 /gblocks/gblocks.6/Add_output_0 0=0
Split            splitncnn_25             1 3 /gblocks/gblocks.6/Add_output_0 /gblocks/gblocks.6/Add_output_0_splitncnn_0 /gblocks/gblocks.6/Add_output_0_splitncnn_1 /gblocks/gblocks.6/Add_output_0_splitncnn_2
Reduction        /gblocks/gblocks.7/norm/ReduceMean 1 1 /gblocks/gblocks.6/Add_output_0_splitncnn_2 /gblocks/gblocks.7/norm/ReduceMean_output_0 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp         /gblocks/gblocks.7/norm/Sub 2 1 /gblocks/gblocks.6/Add_output_0_splitncnn_1 /gblocks/gblocks.7/norm/ReduceMean_output_0 /gblocks/gblocks.7/norm/Sub_output_0 0=1
Split            splitncnn_26             1 2 /gblocks/gblocks.7/norm/Sub_output_0 /gblocks/gblocks.7/norm/Sub_output_0_splitncnn_0 /gblocks/gblocks.7/norm/Sub_output_0_splitncnn_1
BinaryOp         /gblocks/gblocks.7/norm/Pow 1 1 /gblocks/gblocks.7/norm/Sub_output_0_splitncnn_1 /gblocks/gblocks.7/norm/Pow_output_0 0=6 1=1 2=2.000000e+00
Reduction        /gblocks/gblocks.7/norm/ReduceMean_1 1 1 /gblocks/gblocks.7/norm/Pow_output_0 /gblocks/gblocks.7/norm/ReduceMean_1_output_0 0=3 1=0 -23303=1,0 4=1 5=1
BinaryOp         /gblocks/gblocks.7/norm/Add 1 1 /gblocks/gblocks.7/norm/ReduceMean_1_output_0 /gblocks/gblocks.7/norm/Add_output_0 0=0 1=1 2=1.000000e-06
UnaryOp          /gblocks/gblocks.7/norm/Sqrt 1 1 /gblocks/gblocks.7/norm/Add_output_0 /gblocks/gblocks.7/norm/Sqrt_output_0 0=5
BinaryOp         /gblocks/gblocks.7/norm/Div 2 1 /gblocks/gblocks.7/norm/Sub_output_0_splitncnn_0 /gblocks/gblocks.7/norm/Sqrt_output_0 /gblocks/gblocks.7/norm/Div_output_0 0=3
ExpandDims       /gblocks/gblocks.7/norm/Unsqueeze 2 1 gblocks.7.norm.weight /gblocks/gblocks.7/norm/Constant_2_output_0 /gblocks/gblocks.7/norm/Unsqueeze_output_0 -23303=0
ExpandDims       /gblocks/gblocks.7/norm/Unsqueeze_1 2 1 /gblocks/gblocks.7/norm/Unsqueeze_output_0 /gblocks/gblocks.7/norm/Constant_3_output_0 /gblocks/gblocks.7/norm/Unsqueeze_1_output_0 -23303=0
BinaryOp         /gblocks/gblocks.7/norm/Mul 2 1 /gblocks/gblocks.7/norm/Unsqueeze_1_output_0 /gblocks/gblocks.7/norm/Div_output_0 /gblocks/gblocks.7/norm/Mul_output_0 0=2
ExpandDims       /gblocks/gblocks.7/norm/Unsqueeze_2 2 1 gblocks.7.norm.bias /gblocks/gblocks.7/norm/Constant_4_output_0 /gblocks/gblocks.7/norm/Unsqueeze_2_output_0 -23303=0
ExpandDims       /gblocks/gblocks.7/norm/Unsqueeze_3 2 1 /gblocks/gblocks.7/norm/Unsqueeze_2_output_0 /gblocks/gblocks.7/norm/Constant_5_output_0 /gblocks/gblocks.7/norm/Unsqueeze_3_output_0 -23303=0
